tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"

tap "brewsci/bio"
tap "brewsci/science"

cask_args appdir: "/Applications"

brew "awscli"
brew "bat"
brew "bash"
brew "bandwhich"
brew "binutils"
brew "coreutils"
brew "curl"
brew "cloc"
brew "cmatrix"
brew "dfc"
brew "diffutils"
brew "diff-so-fancy"
brew "exa"
brew "elixir"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gawk"
brew "gcal"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gnupg"
brew "grep"
brew "gzip"
brew "htop"
brew "hugo"
brew "iamy"
brew "jq"
brew "kubectx"
brew "less"
brew "lsof"
brew "make"
brew "mas"
brew "mosh"
brew "neovim"
brew "ngrep"
brew "node"
brew "nushell"
brew "packer"
brew "pgcli"
brew "pinentry-mac"
brew "reattach-to-user-namespace"
brew "rg"
brew "rlwrap"
brew "rsync"
brew "rustup-init"
brew "shellcheck"
brew "speedtest-cli"
brew "sops"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "whois"
brew "xsv"

cask "ableton-live-suite"
cask "adobe-creative-cloud"
cask "alfred"
cask "amethyst"
cask "bitwarden"
cask "brave-browser"
cask "caffeine"
cask "disk-inventory-x"
cask "docker"
cask "emacs"
cask "firefox"
cask "google-cloud-sdk"
cask "iterm2"
cask "imageoptim"
cask "java11"
cask "karabiner-elements"
cask "kensington-trackball-works"
cask "keybase"
cask "melodics"
cask "nordvpn"
cask "opera"
cask "sketchup"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"

mas "Flycut", id: 442160987
mas "HardwareGrowler", id: 475260933
mas "The Unarchiver", id: 425424353
mas "Slack", id: 803453959
mas "Battery Health 2", id: 1120214373

# Manual install
# Fuji Raw Studio
# EIZO ColorNavigator
# XLN Studio (Addictive Keys)
# Capture One 20
# Nik Collection
# Synology SSL VPN Client