tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'caskroom/cask'

brew 'archey'
brew 'dfc'
brew 'emacs', args: ['with-cocoa']
brew 'fish'
brew 'htop-osx'
brew 'ncdu'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'weechat', args: ['with-aspell', 'with-curl', 'with-guile', 'with-lua', 'with-perl', 'with-python', 'with-ruby']
brew 'unrar'
brew 'rlwrap'
brew 'openssl'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/lsof'
brew 'homebrew/dupes/make'
brew 'homebrew/dupes/unzip'
brew 'homebrew/dupes/whois'

brew 'node'
brew 'ghc'
brew 'cabal-install'
cask 'idris'
brew 'elixir'
brew 'rust'
brew 'leiningen'

brew 'mesos'

brew 'mosquitto'
brew 'sqlite'

cask 'xquartz'
cask 'aquaterm'
brew 'gnuplot', args: ['with-x11', 'with-aquaterm', 'with-cairo', 'with-wxmac', 'with-qt']
brew 'octave', args: ['with-gui']

cask 'airfoil'
cask 'alfred'
cask 'betterzipql'
cask 'caffeine'
cask 'clipmenu'
cask 'dash'
cask 'firefox'
cask 'flash-player'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'karabiner'
cask 'kensington-trackball-works'
cask 'lastpass'
cask 'mactracker'
cask 'opera'
cask 'plex-home-theater'
cask 'viber'
cask 'virtualbox'
cask 'vivaldi'
cask 'vlc'
cask 'vox'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'skype'
cask 'spectacle'
cask 'suspicious-package'
cask 'synology-cloud-station'
cask 'send-to-kindle'
cask 'tunnelblick'
cask 'vagrant'
cask 'webpquicklook'
