tap 'homebrew/dupes'
tap 'caskroom/cask'

brew 'xz'
brew 'gettext'
brew 'dfc'
brew 'pkg-config'
brew 'emacs', args: ['with-cocoa']
brew 'fish'
brew 'htop-osx'
brew 'openssl'
brew 'libevent'
brew 'ncdu'
brew 'pcre'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/lsof'
brew 'homebrew/dupes/make'
brew 'homebrew/dupes/unzip'
brew 'homebrew/dupes/whois'

cask 'airfoil'
cask 'alfred'
cask 'betterzipql'
cask 'caffeine'
cask 'clipmenu'
cask 'flash-player'
cask 'iterm2'
cask 'karabiner'
cask 'kensington-trackball-works'
cask 'lastpass'
cask 'mactracker'
cask 'opera'
cask 'plex-home-theater'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'spectacle'
cask 'suspicious-package'
cask 'synology-cloud-station'
cask 'viber'
cask 'virtualbox'
cask 'vlc'
cask 'vox'
cask 'webpquicklook'