tap 'homebrew/dupes'
tap 'caskroom/cask'

brew 'dfc'
brew 'emacs', args: ['with-cocoa']
brew 'fish'
brew 'htop-osx'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'weechat', args: ['with-aspell', 'with-curl', 'with-guile', 'with-lua', 'with-perl', 'with-python', 'with-ruby']
brew 'unrar'
brew 'rlwrap'
brew 'openssl'
brew 'mackup'
brew 'ranger'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/lsof'
brew 'homebrew/dupes/make'
brew 'homebrew/dupes/unzip'
brew 'homebrew/dupes/whois'

brew 'ansible'
cask 'vagrant'
brew 'packer'
cask 'gpgtools'
cask 'skype'

cask 'airfoil'
cask 'alfred'
cask 'caffeine'
cask 'clipmenu'
cask 'flash-player'
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'vivaldi'
cask 'iterm2'
cask 'itsycal'
cask 'java'
cask 'karabiner'
cask 'kensington-trackball-works'
cask 'lastpass'
cask 'virtualbox'
cask 'vlc'
cask 'webpquicklook'
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'skype'
cask 'coconutbattery'
cask 'spectacle'
cask 'tunnelblick'